---
kind: type
id: T:Autodesk.Revit.DB.OrdinateDimensionSetting
source: html/d146dae8-f2d4-9102-201a-4756759410d0.htm
---
# Autodesk.Revit.DB.OrdinateDimensionSetting

Represents a collection of Ordinate Dimension settings that can be associated to an ordinate DimensionType.

## Syntax (C#)
```csharp
public class OrdinateDimensionSetting : IDisposable
```